In [1]:
import pandas as pd

In [2]:
df = pd.read_csv(r"C:\Users\mahdy\OneDrive\Desktop\global_tech_salary.txt", sep=",")
df

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,MI,FT,Data Analyst,165000,USD,165000,AU,0,AU,M
1,2023,MI,FT,Data Analyst,70000,USD,70000,US,100,US,M
2,2024,MI,FT,Machine Learning Engineer,85000,EUR,94444,IE,100,IE,M
3,2024,SE,FT,Data Scientist,92700,USD,92700,US,0,US,M
4,2023,MI,FT,Research Engineer,150000,USD,150000,US,0,US,M
...,...,...,...,...,...,...,...,...,...,...,...
4995,2023,SE,FT,Machine Learning Infrastructure Engineer,70000,EUR,75577,FR,100,FR,M
4996,2022,SE,FT,Data Engineer,145000,USD,145000,US,0,US,M
4997,2024,SE,FT,Machine Learning Engineer,153000,USD,153000,US,0,US,M
4998,2022,EN,FT,AI Scientist,30000,EUR,31520,PT,100,ES,M
4999,2023,SE,FT,Machine Learning Engineer,176000,USD,176000,US,0,US,M

In [3]:
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,MI,FT,Data Analyst,165000,USD,165000,AU,0,AU,M
1,2023,MI,FT,Data Analyst,70000,USD,70000,US,100,US,M
2,2024,MI,FT,Machine Learning Engineer,85000,EUR,94444,IE,100,IE,M
3,2024,SE,FT,Data Scientist,92700,USD,92700,US,0,US,M
4,2023,MI,FT,Research Engineer,150000,USD,150000,US,0,US,M

In [4]:
df.sample(5)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
2098,2023,SE,FT,Data Engineer,145000,USD,145000,US,0,US,M
2395,2024,MI,FT,Data Developer,95000,USD,95000,US,0,US,M
4882,2024,SE,FT,Data Engineer,103000,USD,103000,US,0,US,M
4722,2023,MI,FT,Data Engineer,102000,USD,102000,US,0,US,M
782,2023,SE,FT,Data Engineer,94000,USD,94000,US,0,US,M

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           5000 non-null   int64
 1   experience_level    5000 non-null   object
 2   employment_type     5000 non-null   object
 3   job_title           5000 non-null   object
 4   salary              5000 non-null   int64
 5   salary_currency     5000 non-null   object
 6   salary_in_usd       5000 non-null   int64
 7   employee_residence  5000 non-null   object
 8   remote_ratio        5000 non-null   int64
 9   company_location    5000 non-null   object
 10  company_size        5000 non-null   object
dtypes: int64(4), object(7)
memory usage: 429.8+ KB

In [6]:
df["experience_level"] = df["experience_level"].replace({
    "EN":"Entry Level",
    "MI":"Mid Level",
    "SE":"Senior Level",
    "EX":"Executive Level"
})

In [7]:
df["experience_level"].value_counts()

experience_level
Senior Level       3248
Mid Level          1215
Entry Level         375
Executive Level     162
Name: count, dtype: int64

In [8]:
df["employment_type"] = df["employment_type"].replace({
    "FT":"Full Time",
    "PT":"Part Time",
    "CT":"Contract",
    "FL":"Full Time"
})

In [9]:
df["employment_type"].value_counts()

employment_type
Full Time    4981
Contract       10
Part Time       9
Name: count, dtype: int64

In [10]:
df["company_size"]= df["company_size"].replace({
    "S":"Small",
    "M":"Medium",
    "L":"Large"

})

In [11]:
df["company_size"].value_counts()

company_size
Medium    4603
Large      335
Small       62
Name: count, dtype: int64

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           5000 non-null   int64
 1   experience_level    5000 non-null   object
 2   employment_type     5000 non-null   object
 3   job_title           5000 non-null   object
 4   salary              5000 non-null   int64
 5   salary_currency     5000 non-null   object
 6   salary_in_usd       5000 non-null   int64
 7   employee_residence  5000 non-null   object
 8   remote_ratio        5000 non-null   int64
 9   company_location    5000 non-null   object
 10  company_size        5000 non-null   object
dtypes: int64(4), object(7)
memory usage: 429.8+ KB

In [13]:
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,Mid Level,Full Time,Data Analyst,165000,USD,165000,AU,0,AU,Medium
1,2023,Mid Level,Full Time,Data Analyst,70000,USD,70000,US,100,US,Medium
2,2024,Mid Level,Full Time,Machine Learning Engineer,85000,EUR,94444,IE,100,IE,Medium
3,2024,Senior Level,Full Time,Data Scientist,92700,USD,92700,US,0,US,Medium
4,2023,Mid Level,Full Time,Research Engineer,150000,USD,150000,US,0,US,Medium

In [14]:
df["employee_residence"].value_counts()

employee_residence
US    4388
GB     198
CA     116
ES      52
DE      34
FR      21
IN      21
AU      14
PT      13
BR      10
NL       9
IE       7
IT       6
PL       6
ZA       5
LT       5
CO       5
MX       5
EG       5
AR       5
VN       5
NG       5
GR       4
SI       4
BE       4
PH       4
TR       4
AE       3
EE       3
JP       3
UA       3
CF       2
DK       2
TH       2
LV       2
SG       2
MT       2
PK       2
RO       2
GH       2
NZ       1
FI       1
MD       1
KR       1
AT       1
EC       1
HK       1
RU       1
SE       1
CY       1
CH       1
RS       1
HN       1
AM       1
IQ       1
Name: count, dtype: int64

In [15]:
df["employee_residence"]=df["employee_residence"].replace({
    "US": "United States",
    "CY": "Cyprus",
    "UA": "Ukraine",
    "RS": "Serbia",
    "HN": "Honduras",
    "AM": "Armenia",
    "IQ": "Iraq",
    "EC": "Ecuador",
    "HK": "Hong Kong",
    "MD": "Moldova",
    "GH": "Ghana",
    "PK": "Pakistan",
    "MT": "Malta",
    "LV": "Latvia",
    "CF": "Central African Republic",
    "EE": "Estonia",
    "SI": "Slovenia",
    "LT": "Lithuania",
    "GB": "United Kingdom",
    "UK": "United Kingdom",
    "DE": "Germany",
    "FR": "France",
    "ES": "Spain",
    "IT": "Italy",
    "CA": "Canada",
    "AU": "Australia",
    "IN": "India",
    "CN": "China",
    "JP": "Japan",
    "BR": "Brazil",
    "MX": "Mexico",
    "RU": "Russia",
    "KR": "South Korea",
    "NL": "Netherlands",
    "BE": "Belgium",
    "SE": "Sweden",
    "NO": "Norway",
    "DK": "Denmark",
    "FI": "Finland",
    "CH": "Switzerland",
    "AT": "Austria",
    "PL": "Poland",
    "PT": "Portugal",
    "GR": "Greece",
    "IE": "Ireland",
    "CZ": "Czech Republic",
    "HU": "Hungary",
    "RO": "Romania",
    "BG": "Bulgaria",
    "TR": "Turkey",
    "SA": "Saudi Arabia",
    "AE": "United Arab Emirates",
    "EG": "Egypt",
    "ZA": "South Africa",
    "NG": "Nigeria",
    "KE": "Kenya",
    "MA": "Morocco",
    "TN": "Tunisia",
    "AR": "Argentina",
    "CL": "Chile",
    "CO": "Colombia",
    "PE": "Peru",
    "ID": "Indonesia",
    "MY": "Malaysia",
    "SG": "Singapore",
    "TH": "Thailand",
    "VN": "Vietnam",
    "PH": "Philippines",
    "NZ": "New Zealand" 
})

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           5000 non-null   int64
 1   experience_level    5000 non-null   object
 2   employment_type     5000 non-null   object
 3   job_title           5000 non-null   object
 4   salary              5000 non-null   int64
 5   salary_currency     5000 non-null   object
 6   salary_in_usd       5000 non-null   int64
 7   employee_residence  5000 non-null   object
 8   remote_ratio        5000 non-null   int64
 9   company_location    5000 non-null   object
 10  company_size        5000 non-null   object
dtypes: int64(4), object(7)
memory usage: 429.8+ KB

In [17]:
df["company_location"]=df["company_location"].replace({
    "US": "United States",
    "CY": "Cyprus",
    "UA": "Ukraine",
    "RS": "Serbia",
    "HN": "Honduras",
    "AM": "Armenia",
    "IQ": "Iraq",
    "EC": "Ecuador",
    "HK": "Hong Kong",
    "MD": "Moldova",
    "GH": "Ghana",
    "PK": "Pakistan",
    "MT": "Malta",
    "LV": "Latvia",
    "CF": "Central African Republic",
    "EE": "Estonia",
    "SI": "Slovenia",
    "LT": "Lithuania",
    "GB": "United Kingdom",
    "UK": "United Kingdom",
    "DE": "Germany",
    "FR": "France",
    "ES": "Spain",
    "IT": "Italy",
    "CA": "Canada",
    "AU": "Australia",
    "IN": "India",
    "CN": "China",
    "JP": "Japan",
    "BR": "Brazil",
    "MX": "Mexico",
    "RU": "Russia",
    "KR": "South Korea",
    "NL": "Netherlands",
    "BE": "Belgium",
    "SE": "Sweden",
    "NO": "Norway",
    "DK": "Denmark",
    "FI": "Finland",
    "CH": "Switzerland",
    "AT": "Austria",
    "PL": "Poland",
    "PT": "Portugal",
    "GR": "Greece",
    "IE": "Ireland",
    "CZ": "Czech Republic",
    "HU": "Hungary",
    "RO": "Romania",
    "BG": "Bulgaria",
    "TR": "Turkey",
    "SA": "Saudi Arabia",
    "AE": "United Arab Emirates",
    "EG": "Egypt",
    "ZA": "South Africa",
    "NG": "Nigeria",
    "KE": "Kenya",
    "MA": "Morocco",
    "TN": "Tunisia",
    "AR": "Argentina",
    "CL": "Chile",
    "CO": "Colombia",
    "PE": "Peru",
    "ID": "Indonesia",
    "MY": "Malaysia",
    "SG": "Singapore",
    "TH": "Thailand",
    "VN": "Vietnam",
    "LU": "Luxembourg",
    "AS": "American Samoa",
    "PH": "Philippines",
    "NZ": "New Zealand" 
})

In [18]:
df["company_location"].value_counts()

company_location
United States               4402
United Kingdom               202
Canada                       115
Spain                         52
Germany                       34
France                        20
Australia                     16
India                         16
Portugal                      12
Netherlands                   11
Brazil                         9
Ireland                        7
Mexico                         6
Poland                         6
Colombia                       5
Lithuania                      5
South Africa                   5
Italy                          5
Egypt                          4
Nigeria                        4
Slovenia                       4
Estonia                        4
United Arab Emirates           3
Argentina                      3
Vietnam                        3
Turkey                         3
Malta                          2
Thailand                       2
Latvia                         2
Ghana                          2
Belgium                        2
Luxembourg                     2
Denmark                        2
Ukraine                        2
Austria                        2
Switzerland                    2
Greece                         2
Japan                          2
Philippines                    2
Central African Republic       2
Singapore                      2
American Samoa                 1
Pakistan                       1
South Korea                    1
IL                             1
Honduras                       1
Romania                        1
Finland                        1
Ecuador                        1
Sweden                         1
Malaysia                       1
New Zealand                    1
Russia                         1
Armenia                        1
Iraq                           1
Name: count, dtype: int64

In [19]:
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,Mid Level,Full Time,Data Analyst,165000,USD,165000,Australia,0,Australia,Medium
1,2023,Mid Level,Full Time,Data Analyst,70000,USD,70000,United States,100,United States,Medium
2,2024,Mid Level,Full Time,Machine Learning Engineer,85000,EUR,94444,Ireland,100,Ireland,Medium
3,2024,Senior Level,Full Time,Data Scientist,92700,USD,92700,United States,0,United States,Medium
4,2023,Mid Level,Full Time,Research Engineer,150000,USD,150000,United States,0,United States,Medium

In [20]:
df.to_csv("Salary.csv",sep=",", index=False)